start_message_member = """⌔︙أهلآ بك في بوت {bot_name}
⌔︙اختصاص البوت حماية المجموعات
⌔︙لتفعيل البوت عليك اتباع مايلي ...
⌔︙اضف البوت الى مجموعتك
⌔︙ارفعه ادمن 
⌔︙ليتم تفعيل المجموعة تلقائيا
⌔︙معرف البوت ← @{bot_username}
⌔︙مطور البوت ← @{dev_username}"""


copy_right = """
# The idea and the code was done by Almortagel
# Tele: @Almortagel_12
# Before using anything, please mention the source, all rights reserved
"""
Welcome_message = """• مرحبا بك في قسم رساله الترحيب  🌾
- ستظهر هذه الرساله عند ارسال (اي رسالة) الى البوت الخاص بك 

- ارساله الحاليه : {msg}"""

message_for_admin = "اهلا مطوري اليك كيب المطور"


Compulsory_subscription_letter_dep = """• مرحبا بك في قسم الاشتراك الاجباري 💫

- قناة الاشتراك الاساسية : {a}  ! 
- رساله الاشتراك الاساسية : {b}"""

sign_chanell_message = """• قم برفع البوت ادمن في قناتك اولا 🌟

• من ثم ارسال معرف او ايدي القناة او قم بعمل توجيه لاي منشور من قناتك الى البوت"""

Compulsory_subscription_letter = "⌔︙عليك الاشتراك في قناة البوت لأستخدام الاوامر🚀."


InformationChannelreply = """اهلا بك في قسم تعيين قناه:
يمكنك اضافه قناه للتحكم في الردود - اضافه - مسح - عرض - مسح الكل

لإضافة رد عام من خلال قناتك ارسل رساله هكذا:    اسم الرد : قيمه الرد
مع الاخذ بنظر الاعتبار ان في حال ادخل نفس اسم الرد و قيمه جديده للرد سيتم اضافتها مع القيمة الجديدة 
مثال: احمد : اهلا بك,
احمد : اهلا بك مجددا,
أي سيكون لاسم الرد "احمد" قيمتان هما: اهلا بك + اهلا بك مجددا, و القيمة الراجعة ستكون قيمه عشوائية!

لمسح رد عام من خلال قناتك, قم بالرد على رساله تحوي اسم الرد و قيمته بكلمه "مسح"

لمسح جميع الردود ارسل رساله "مسح الردود"

لعرض قيمه رد ما, ارسل "عرض" + اسم الرد,
مثال: عرض احمد."""


msgCmd = """

✯︙ اهلا بك عزيزي في قائمة الاوامر ✓
"""

M1 = """

            
- (اوامر الرفع والتنزيل) .

- رفع - تنزيل مشرف .
- تنزيل الكل  .

- (اوامر المسح) .

- مسح المحظورين .
- مسح المطرودين .
- مسح المكتومين .
- مسح البوتات .
- مسح نقاطي
- مسح رسائلي
- مسح سحكاتي
- مسح - بالرد - مسح رسالة .
- تنظيف - تنظيف الرسائل .
- مسح ترحيب .

- (اوامر الطرد الحظر الكتم) .

- حظر - بالرد .
- طرد - بالرد .
- كتم - بالرد .
- تقييد - بالرد .
- تحذير - بالرد .

- الغاء حظر - بالرد .
- الغاء كتم - بالرد .
- الغاء تقييد - بالرد .
- كشف البوتات .

- (اوامر النطق) .

- كول - النص .
- شنو يكول - قريبا .

- (اوامر اخرى) .

- الرابط .
- ايدي .
- صورتي - افتاري .
- ايدي - بالرد .
- كشف بالرد
- نقاطي
- سحكاتي
- رسائلي
- سحكاته بالرد
- نقاطه بالرد
- رسائله بالرد
- رتبتي
- لقبي
- رتبته بالرد
- لقبه بالرد


- انشاء رابط .
"""

M2 = """
 

- (اوامر الوضع) .

- اضف ترحيب .
- اضف امر .

- (اوامر رؤية الاعدادات) .

- الادمنية .
- المالكين .
- المكتومين .
- المحظورين .
- المطرودين .
- الاعدادات .

"""

M3 = """
 

- (اوامر الردود) .

- الردود - تشوف كل الردود المضافة .
- اضف رد - عشان تضيف رد .
- حذف رد - عشان تحذف رد .
- مسح الردود - لمسح جميع الردود المضافه .

- (اوامر القفل والفتح) .

- قفل - فتح التعديل .
- قفل - فتح الفيديوهات .
- قفل - فتح الصور .
- قفل - فتح الملصقات .
- قفل - فتح الملفات .
- ثقل - فتح المتحركات .
- قفل - فتح الدردشة .
- قفل - فتح الروابط .
- قفل - فتح الاشعارات .
- قفل - فتح التكرار .
- قفل - فتح التوجيه .
- قفل - فتح الانلاين .
- قفل - فتح الجهات .
- قفل - فتح السب .

- (اوامر التفعيل والتعطيل) .

- تفعيل - تعطيل الترحيب .
- تفعيل - تعطيل الايدي .
- تفعيل - تعطيل الايدي بالصوره .

"""

M5 = """
 
- (الالعاب) .

- تفعيل الالعاب .
- تعطيل الالعاب .
- كت , كت تويت


- (اوامر الزواج) .

- زواج - بالرد - عشان تتزوج  
- طلاق - بالرد - عشان تطلقها 
- خلع - بالرد - عشان تطلقك  

"""

M4 = """

- (اليوتيوب) .

- تفعيل اليوتيوب .
- تعطيل اليوتيوب .

- (البحث والتحميل) .

- يوت اسم الاغنية .
- بحث اسم الاغنية او الفيديو .

"""


KitList = [
    "اخر افلام شاهدتها",
    "ما هيا عيوب  ؟ ",
    " هل بتكراش ع حد في حياتك؟",
    " ينفع نرتبط؟",
    " ممكن توريني صوره بتحبها؟",
    " ممكن نبقي صحااب ع الفيس؟",
    "عندك كام اكس في حياتك؟ ",
    "ينفع تبعتلي رقمك؟ ",
    " ما تيجي اعزمني ع حاجه بحبها؟",
    "ينفع احضنك؟ ",
    "قولي ع اكبر غلطه ندمان عليهاا؟ ",
    "عندك كام سنه؟ ",
    " عامل بلوك لكام واحد عندك؟",
    " قولي سر محدش يعرفه؟",
    " عندك كام اكس في حياتك؟",
    "بتعرف تقلش وتهزر؟ ",
    " لونك المفضل هو؟",
    "كتابك المفضل",
    "هوايتك المفضله",
    "علاقتك مع اهلك",
    " ما السيء في هذه الحياة ؟ ",
    "أجمل شيء حصل معك خلال هذا الاسبوع ؟ ",
    "سؤال ينرفزك ؟ ",
    " هل يعجبك  ؟؟ ",
    " اكثر ممثل تحبه ؟ ",
    "قد تخيلت شي في بالك وصار ؟ ",
    "شيء عندك اهم من الناس ؟ ",
    "تفضّل النقاش الطويل او تحب الاختصار ؟ ",
    "وش أخر شي ضيعته؟ ",
    "اي رايك في  ؟ ",
    "كم مره حبيت؟ ",
    " اكثر المتابعين عندك باي برنامج؟",
    " اخر مره ضربت عشره كانت متى ؟",
    " نسبه الندم عندك للي وثقت فيهم ؟",
    "تحب ترتبط بكيرفي ولا فلات؟",
    " جربت شعور احد يحبك بس انت مو قادر تحبه؟",
    " تجامل الناس ولا اللي بقلبك على لسانك؟",
    " عمرك ضحيت باشياء لاجل شخص م يسوى ؟",
    "مغني تلاحظ أن صوته يعجب الجميع إلا أنت؟ ",
    " اخر غلطات عمرك؟ ",
    " مسلسل كرتوني له ذكريات جميلة عندك؟ ",
    " ما أكثر تطبيق تقضي وقتك عليه؟ ",
    " أول شيء يخطر في بالك إذا سمعت كلمة نجوم ؟ ",
    " قدوتك من الأجيال السابقة؟ ",
    " أكثر طبع تهتم بأن يتواجد في شريك/ة حياتك؟ ",
    "أكثر حيوان تخاف منه؟ ",
    " ما هي طريقتك في الحصول على الراحة النفسية؟ ",
    " إيموجي يعبّر عن مزاجك الحالي؟ ",
    " أكثر تغيير ترغب أن تغيّره في نفسك؟ ",
    "أكثر شيء أسعدك اليوم؟ ",
    "اي رايك في الدنيا دي ؟ ",
    "ما هو أفضل حافز للشخص؟ ",
    "ما الذي يشغل بالك في الفترة الحالية؟",
    "اخر شيء ندمت عليه؟ ",
    "شاركنا صورة احترافية من تصويرك؟ ",
    "تتابع انمي؟ إذا نعم ما أفضل انمي شاهدته ",
    "يرد عليك متأخر على رسالة مهمة وبكل برود، موقفك؟ ",
    "نصيحه تبدا ب -لا- ؟ ",
    "كتاب أو رواية تقرأها هذه الأيام؟ ",
    "فيلم عالق في ذهنك لا تنساه مِن روعته؟ ",
    "يوم لا يمكنك نسيانه؟ ",
    "شعورك الحالي في جملة؟ ",
    "كلمة لشخص بعيد؟ ",
    "صفة يطلقها عليك الشخص المفضّل؟ ",
    "أغنية عالقة في ذهنك هاليومين؟ ",
    "أكلة مستحيل أن تأكلها؟ ",
    "كيف قضيت نهارك؟ ",
    "تصرُّف ماتتحمله؟ ",
    "موقف غير حياتك؟ ",
    "اكثر مشروب تحبه؟ ",
    "القصيدة اللي تأثر فيك؟ ",
    "متى يصبح الصديق غريب ",
    "وين نلقى السعاده برايك؟ ",
    "تاريخ ميلادك؟ ",
    "قهوه و لا شاي؟ ",
    "من محبّين الليل أو الصبح؟ ",
    "حيوانك المفضل؟ ",
    "كلمة غريبة ومعناها؟ ",
    "كم تحتاج من وقت لتثق بشخص؟ ",
    "اشياء نفسك تجربها؟ ",
    "يومك ضاع على؟ ",
    "كل شيء يهون الا ؟ ",
    "اسم ماتحبه ؟ ",
    "وقفة إحترام للي إخترع ؟ ",
    "أقدم شيء محتفظ فيه من صغرك؟ ",
    "كلمات ماتستغني عنها بسوالفك؟ ",
    "وش الحب بنظرك؟ ",
    "حب التملك في شخصِيـتك ولا ؟ ",
    "تخطط للمستقبل ولا ؟ ",
    "موقف محرج ماتنساه ؟ ",
    "من طلاسم لهجتكم ؟ ",
    "اعترف باي حاجه ؟ ",
    "عبّر عن مودك بصوره ؟ ",
    "اخر مره ضربت عشره كانت متى ؟",
    "اسم دايم ع بالك ؟ ",
    "اشياء تفتخر انك م سويتها ؟ ",
    " لو بكيفي كان ؟ ",
    "أكثر جملة أثرت بك في حياتك؟ ",
    "إيموجي يوصف مزاجك حاليًا؟ ",
    "أجمل اسم بنت بحرف الباء؟ ",
    "كيف هي أحوال قلبك؟ ",
    "أجمل مدينة؟ ",
    "كيف كان أسبوعك؟ ",
    "شيء تشوفه اكثر من اهلك ؟ ",
    "اخر مره فضفضت؟ ",
    "قد كرهت احد بسبب اسلوبه؟ ",
    "قد حبيت شخص وخذلك؟ ",
    "كم مره حبيت؟ ",
    "اكبر غلطة بعمرك؟ ",
    "نسبة النعاس عندك حاليًا؟ ",
    "شرايكم بمشاهير التيك توك؟ ",
    "ما الحاسة التي تريد إضافتها للحواس الخمسة؟ ",
    "اسم قريب لقلبك؟ ",
    "مشتاق لمطعم كنت تزوره قبل الحظر؟ ",
    "ما أول مشروع تتوقع أن تقوم بإنشائه إذا أصبحت مليونير؟ ",
    "أغنية عالقة في ذهنك هاليومين؟ ",
    "متى اخر مره قريت قران؟ ",
    "لو عشقك مطوري تقبل؟ ",
]

KitListt = [
   "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ🌸",
   "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ , وَشُكْرِكَ , وَحُسْنِ عِبَادَتِكَ🎈💞",
   "استغفر الله العظيم وأتوبُ إليه 🌹",
   "حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم"
   "ِ سبع مرات، كفاه الله تعالى ما أهمه من أمور الدنيا والآخرة🌹🌸",
   "ربنا اغفر لنا ذنوبنا وإسرافنا فِي أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين🌸",
   "أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
   "سبحان الله وبحمده سبحان الله العظيم🌸",
   "أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
   "اللهم إنك عفو تُحب العفو فاعفُ عنّا 🌿🌹",
   "استغفر الله العظيم وأتوبُ إليه 🌹",
   "لا تقطع صلاتك، إن كنت قادراً على الصلاة في الوقت فصلِي و أكثر من الدعاء لتحقيق ما تتمنى💙",
   "قال ﷺ : ”حَيْثُمَا كُنْتُمْ فَصَلُّوا عَلَيَّ، فَإِنَّ صَلَاتَكُمْ تَبْلُغُنِي“.",
   "يا رب أفرحني بشيئاً انتظر حدوثه،اللهم إني متفائلاً بعطائك فاكتب لي ما أتمنى🌸",
   "﴿ رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي ﴾",
   "‏{ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ }",
   "‏اللهّم لطفك بقلوبنا وأحوالنا وأيامنا ،‏اللهّم تولنا بسعتك وعظيم فضلك ",
   "ومن أحسن قولاً ممن دعا إلى الله وعمل صالحاً وقال أنني من المسلمين .💕",
   "‏إن الله لا يبتليك بشيء إلا وبه خيرٌ لك فقل الحمدلله.",
   "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ",
   "اللهم اشفي كل مريض يتألم ولا يعلم بحاله إلا أنت",
   "استغفر الله العظيم وأتوبُ إليه.",
   "‏لَم تعرف الدنيا عظيماً مِثله صلّوا عليه وسلموا تسليم",
   " أنتَ اللّطيف وأنا عبدُك الضّعيف اغفرلي وارحمني وتجاوز عنّي.",
   "ماتستغفر ربنا كده🥺❤️",
   "فاضي شويه نصلي ع النبي ونحز خته فى الجنه❤️❤️",
   "ماتوحدو ربنا يجماعه قولو لا اله الا الله❤️❤️",
   "يلا كل واحد يقول سبحان الله وبحمده سبحان الله العظيم 3 مرات🙄❤️",
   "قول لاحول ولا قوه الا بالله يمكن تفك كربتك🥺❤️",
   "اللهم صلي عللى سيدنا محمد ماتصلي على النبي كده",
   "- أسهل الطرق لإرضاء ربك، أرضي والديك 🥺💕",
   "- اللهُم صبراً ، اللهم جبراً ، اللهم قوّة",
   "أصبحنا وأصبح الملك لله ولا اله الا الله.",
   "‏إنَّ اللهَ يُحِبُ المُلحِينَ فِي الدُّعَاء.",
   "‏إن الله لا يخذل يداً رُفعت إليه أبداً.",
   "يارب دُعاء القلب انت تسمعه فأستجب لهُ.",
   "- اللهم القبول الذي لا يزول ❤️🍀.",
   "- اللهُم خذ بقلبّي حيث نورك الذي لا ينطفِئ.",
   "سبحان الله وبحمده ،سبحان الله العظيم.",
   "لا تعودوا أنفسكم على الصمت، اذكرو الله، استغفروه، سبّحوه، احمدوه،"
   " عودوا السنتكم على الذكر فإنها إن اعتادت لن تصمت أبدًا.",
   "- اللهم بلغنا رمضان وأجعلنا نختم القرآن واهدنا لبر الامان يالله يا رحمان 🌙",
   "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العلي- ثلاث مرات -",
   "- اللهم احرمني لذة معصيتك وارزقني لذة طاعتك 🌿💜.",
   "- اللهُم إن في صوتي دُعاء وفي قلبِي أمنية اللهُم يسر لي الخير حيث كان.",
   "‏اللهم أرني عجائب قدرتك في تيسير أموري 💜.",
   "يغفر لمن يشاء إجعلني ممن تشاء يا الله.*",
   "‏يارب إن قصّرنا في عبادتك فاغفرلنا، وإن سهينا عنك بمفاتن الدنيا فردنا إليك رداً جميلاً 💜🍀",
   "صلوا على من قال في خطبة الوداع  ‏و إني مُباهٍ بكم الأمم يوم القيامة♥️⛅️",
   "اللهـم إجعلنا ممن تشهد أصابعهم بذكـر الشهادة قبل الموت 🌿💜.",
   "- وبك أصبحنا يا عظيم الشأن 🍃❤️.",
   "اللهُم الجنة ونعيَّم الجنة مع من نحب💫❤️🌹",
   "‏اللهم قلبًا سليمًا عفيفًا تقيًا نقيًا يخشاك سرًا وعلانية🤍🌱",
   "- أسجِد لربِك وأحضِن الارض فِي ذِ  لاضَاق صَدرِك مِن هَموم المعَاصِي 🌿.",
   "صلي على النبي بنيه الفرج❤️",
   "استغفر ربنا كده 3 مرات هتاخد ثواب كبير اوى❤️",
   "اشهد ان لا اله الا الله وان محمدا عبده ورسوله",
   "لا اله الا الله سيدنا محمد رسول الله🌿💜",
   "قول معايا - استغفر الله استفر الله استغفر الله -",
   "مُجرد ثانية تنفعِك : أستغفُرالله العظيِم وأتوب إليّه.",
   "أدعُ دُعاء الواثِق فالله لايُجرّبُ معه‌‏",
   "صلي على اشرف الخلق سيدنا محمد صلاةً الله عليه وسلم تسليما كثيرا ❤️",
   "ربي اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاءنا . ربنا تقبل منا إنك أنت السميع العليم وتب علينا إنك أنت التواب الرحيم",
   "رب اغفر لي خطيئتي يوم الدين❤️",
   "اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شرما قضيت، إنه لا يذل من واليت، تباركت ربنا وتعاليت",
   "اللهم إني أعوذ بك من عذاب النار، وأعوذ بك من عذاب القبر، وأعوذ بك من الفتن ما ظهر منها وما بطن، وأعوذ بك من فتنة الدجال",
   "اللهم إني أعوذ بك من علم لا ينفع وعمل لا يرفع وقلب لا يخشع وقول لا يسمع",
   "اللهم لا تخزني يوم القيامة",
   "اللهم إني أعوذ بك من صلاة لا تنفع",
   "اللهم إني أسألك الفردوس أعلى الجنة",
   "أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ. مرة واحدة",
   "اللهم يا رحمن يا حنان يا منان استودعك يا رب قلبي فلا تجعل فيه أحدا سواك واستودعتك شهادة لا إله إلا الله فألهمني بها يا رب عند الممات واستودعك اللهم نفسي فلا تجعلني أخطو خطوة واحدة إلا في مرضاتك واستودعك روقي وعافيتي فاحفظها لي.",
   "اللهم يا كريم يا ودود يا رحيم يا عظيم انك قادر على كل شيء انك تقول للشيء كن فيكون ارحم اهلي رحمة دائمة واجعلهم من أهل الجنه في الفردوس لأعلي اللهم تقبلهم إليك واسعدهم بلقائك",
   "اللهم يا رحمن يارحيم ارحمني برحمتك الواسعه يارب ونقني من زنوبي مثل نقاء الثوب الأبيض من الدنس",
   "رَبَّنَا اغفِر لي وَلِوالِدَيَّ وَلِلمُؤمِنينَ يَومَ يَقومُ الحِسابُ",
   "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا",
   "اللهمَّ اغفر لوالدي وارحمهما كما ربّياني صغيراً، اللهمّ يا باسط اليدين بالعطايا ابسط على والدي من فضلك العظيم وجودك الواسع ما تشرح به صدرهما لعبادتك وطاعتك، والأنس بك والعمل بما يُرضيك، وبارك لهما في عُمرها، واغنهما من فضلك، وأعنهما في حلّهما وترحالهما وذهابهما وإيابهما، وأطل في عمرهما مع العافية في صحتهما ودِينهما، واجعل اللهمَّ آخر كلامهما من الدنيا لا إله إلّا الله محمدٌ رسول الله",
   "(اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي)).",
   "يا حيّ يا قيّوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عينٍ أبداً ...",
   "‏﴿ وَاذْكُر ربّكَ إِذَا نَسِيتَ ﴾ ",
   "- اللهم صلِ وسلم على نبينآ محمد ❥⇣",
   "((اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ)) (عشرَ مرَّاتٍ).",
   "اللهم يا عزيز يا جبار اجعل قلوبنا تخشع من تقواك واجعل عيوننا تدمع من خشياك واجعلنا يا رب من أهل التقوى وأهل المغفر",
   "استغفر الله و اتوب اليه - استغفر الله و اتوب اليه - استغفر الله و اتوب اليه - استغفر الله و اتوب اليه - استغفر الله و اتوب الي",
   "اللهم إنك عفو تُحب العفو فاعفُ عن",
   "اللهم إني أسألك الثبات في الامر والعزيمة على الرشد واسالك قلبا سليما ولسانا صادقا واسالك شكر نعمتك و حسن عبادت",
   "اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي، وأهلي ومالي، اللهم استُر عوراتي، وآمِن رَوعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أُغتال من تحتي",
   "((اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ)).",
   "((لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ)) (مائةَ مرَّةٍ).",
   "((اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ))",
   "اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك",
   "(بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ)",
   "((أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ)) (مِائَةَ مَرَّةٍ فِي الْيَوْمِ).",
   "اللهم نشكوا إليك ضعفنا وقلة حيلتنا من امرنا فأغثنا وارحمنا واغفرلنا ولا تكل امرنا لمن لايخافك ولا يرحمنا ولا تؤخذنا بما فعل السفهاء منا",
   "مَنْ كَانَ آخِرُ كَلاَمِهِ لاَ إِلَهَ إِلاَّ اللَّهُ دَخَلَ الْجَنَّة"
   "االلَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ , وَشُكْرِكَ , وَحُسْنِ عِبَادَتِكَ🎈💞 ",
"من الأدعية النبوية المأثورة:اللهمَّ زَيِّنا بزينة الإيمان",
"اااللهم يا من رويت الأرض مطرا أمطر قلوبنا فرحا 🍂 ",
"اا‏اللَّهُـمَّ لَڪَ الحَمْـدُ مِنْ قَـا؏ِ الفُـؤَادِ إلىٰ ؏َـرشِڪَ المُقـدَّس حَمْـدَاً يُوَافِي نِـ؏ـمَڪ 💙🌸",
"﴿وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا﴾🌿✨",
"﴿وَمَن يَتَّقِ اللهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا﴾",
"«سُبْحَانَ اللهِ ، وَالحَمْدُ للهِ ، وَلَا إلَهَ إلَّا اللهُ ، وَاللهُ أكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إلَّا بِاللهِ»🍃",
"وذُنُوبًا شوَّهتْ طُهْرَ قُلوبِنا؛ اغفِرها يا ربّ واعفُ عنَّا ❤️",
"«اللَّهُمَّ اتِ نُفُوسَنَا تَقْوَاهَا ، وَزَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا ، أنْتَ وَلِيُّهَا وَمَوْلَاهَا»🌹",
"۝‏﷽إن اللَّه وملائكته يُصلُّون على النبي ياأيُّها الذين امنوا صلُّوا عليه وسلِّموا تسليما۝",
"فُسِبًحً بًحًمًدٍ ربًکْ وٌکْنِ مًنِ الَسِاجّدٍيَنِ 🌿✨",
"اأقُمً الَصّلَاةّ لَدٍلَوٌکْ الَشُمًسِ إلَيَ غُسِقُ الَلَيَلَ🥀🌺",
"نِسِتٌغُفُرکْ ربًيَ حًيَتٌ تٌلَهّيَنِا الَدٍنِيَا عٌنِ ذِکْرکْ🥺😢",
"وٌمًنِ أعٌرض عٌنِ ذِکْريَ فُإنِ لَهّ مًعٌيَشُةّ ضنِکْا 😢",
"وٌقُرأنِ الَفُجّر إنِ قُرانِ الَفُجّر کْانِ مًشُهّوٌدٍا🎀🌲",
"اأّذّأّ أّلَدِنِيِّأّ نَِّستّګوِ أّصٌلَګوِ زِّوِروِ أّلَمَقِأّبِر💔",
"حًتٌيَ لَوٌ لَمًتٌتٌقُنِ الَخِفُظُ فُمًصّاحًبًتٌ لَلَقُرانِ تٌجّعٌلَکْ مًنِ اهّلَ الَلَهّ وٌخِاصّتٌهّ❤🌱",
"وٌإذِا رضيَتٌ وٌصّبًرتٌ فُهّوٌ إرتٌقُاء وٌنِعٌمًةّ✨??",
"«ربً اجّعٌلَنِيَ مًقُيَمً الَصّلَاةّ وٌمًنِ ذِريَتٌيَ ربًنِا وٌتٌقُبًلَ دٍعٌاء 🤲",
"ااعٌلَمً انِ رحًلَةّ صّبًرکْ لَهّا نِهّايَهّ عٌظُيَمًهّ مًحًمًلَهّ بًجّوٌائزٍ ربًانِيَهّ مًدٍهّشُهّ🌚☺️",
"اإيَاکْ وٌدٍعٌوٌةّ الَمًظُلَوٌمً فُ إنِهّا تٌصّعٌدٍ الَيَ الَلَهّ کْأنِهّا شُرارهّ مًنِ نِار 🔥🥺",
"االَلَهّمً انِقُذِ صّدٍوٌرنِا مًنِ هّيَمًنِهّ الَقُلَقُ وٌصّبً عٌلَيَهّا فُيَضا مًنِ الَطِمًأنِيَنِهّ✨🌺",
"يَابًنِيَ إنِ صّلَاح الَحًيَاةّ فُ أتٌجّاهّ الَقُبًلَهّ 🥀🌿",
"الَلَهّمً ردٍنِا إلَيَکْ ردٍا جّمًيَلَا💔🥺"
   ]
   
   
KitLisst = [
"لو خيروك |  بين شراء منزل صغير أو استئجار فيلا كبيرة بمبلغ معقول؟ ",
"لو خيروك |  أن تعيش قصة فيلم هل تختار الأكشن أو الكوميديا؟ ",
"لو خيروك |  بين تناول البيتزا وبين الايس كريم وذلك بشكل دائم؟ ",
"لو خيروك |  بين إمكانية تواجدك في الفضاء وبين إمكانية تواجدك في البحر؟ ",
"لو خيروك |  بين تغيير وظيفتك كل سنة أو البقاء بوظيفة واحدة طوال حياتك؟ ",
"لو خيروك |  أسئلة محرجة أسئلة صراحة ماذا ستختار؟ ",
"لو خيروك |  بين الذهاب إلى الماضي والعيش مع جدك أو بين الذهاب إلى المستقبل والعيش مع أحفادك؟ ",
"لو كنت شخص اخر هل تفضل البقاء معك أم أنك ستبتعد عن نفسك؟ ",
"لو خيروك |  بين الحصول على الأموال في عيد ميلادك أو على الهدايا؟ ",
"لو خيروك |  بين القفز بمظلة من طائرة أو الغوص في أعماق البحر؟ ",
"لو خيروك |  بين الاستماع إلى الأخبار الجيدة أولًا أو الاستماع إلى الأخبار السيئة أولًا؟ ",
"لو خيروك |  بين أن تكون رئيس لشركة فاشلة أو أن تكون موظف في شركة ناجحة؟ ",
"لو خيروك |  بين أن يكون لديك جيران صاخبون أو أن يكون لديك جيران فضوليون؟ ",
"لو خيروك |  بين أن تكون شخص مشغول دائمًا أو أن تكون شخص يشعر بالملل دائمًا؟ ",
"لو خيروك |  بين قضاء يوم كامل مع الرياضي الذي تشجعه أو نجم السينما الذي تحبه؟ ",
"لو خيروك |  بين استمرار فصل الشتاء دائمًا أو بقاء فصل الصيف؟ ",
"لو خيروك |  بين العيش في القارة القطبية أو العيش في الصحراء؟ ",
"لو خيروك |  بين أن تكون لديك القدرة على حفظ كل ما تسمع أو تقوله وبين القدرة على حفظ كل ما تراه أمامك؟ ",
"لو خيروك |  بين أن يكون طولك 150 سنتي متر أو أن يكون 190 سنتي متر؟ ",
"لو خيروك |  بين إلغاء رحلتك تمامًا أو بقائها ولكن فقدان الأمتعة والأشياء الخاص بك خلالها؟ ",
"لو خيروك |  بين أن تكون اللاعب الأفضل في فريق كرة فاشل أو أن تكون لاعب عادي في فريق كرة ناجح؟ ",
"لو خيروك |  بين ارتداء ملابس البيت لمدة أسبوع كامل أو ارتداء البدلة الرسمية لنفس المدة؟ ",
"لو خيروك |  بين امتلاك أفضل وأجمل منزل ولكن في حي سيء أو امتلاك أسوأ منزل ولكن في حي جيد وجميل؟ ",
"لو خيروك |  بين أن تكون غني وتعيش قبل 500 سنة، أو أن تكون فقير وتعيش في عصرنا الحالي؟ ",
"لو خيروك |  بين ارتداء ملابس الغوص ليوم كامل والذهاب إلى العمل أو ارتداء ملابس جدك/جدتك؟ ",
"لو خيروك |  بين قص شعرك بشكل قصير جدًا أو صبغه باللون الوردي؟ ",
"لو خيروك |  بين أن تضع الكثير من الملح على كل الطعام بدون علم أحد، أو أن تقوم بتناول شطيرة معجون أسنان؟ ",
"لو خيروك |  بين قول الحقيقة والصراحة الكاملة مدة 24 ساعة أو الكذب بشكل كامل مدة 3 أيام؟ ",
"لو خيروك |  بين تناول الشوكولا التي تفضلها لكن مع إضافة رشة من الملح والقليل من عصير الليمون إليها أو تناول ليمونة كاملة كبيرة الحجم؟ ",
"لو خيروك |  بين وضع أحمر الشفاه على وجهك ما عدا شفتين أو وضع ماسكارا على شفتين فقط؟ ",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟ ",
"لو خيروك |  بين تلوين شعرك كل خصلة بلون وبين ارتداء ملابس غير متناسقة لمدة أسبوع؟ ",
"لو خيروك |  بين تناول مياه غازية مجمدة وبين تناولها ساخنة؟ ",
"لو خيروك |  بين تنظيف شعرك بسائل غسيل الأطباق وبين استخدام كريم الأساس لغسيل الأطباق؟ ",
"لو خيروك |  بين تزيين طبق السلطة بالبرتقال وبين إضافة البطاطا لطبق الفاكهة؟ ",
"لو خيروك |  بين اللعب مع الأطفال لمدة 7 ساعات أو الجلوس دون فعل أي شيء لمدة 24 ساعة؟ ",
"لو خيروك |  بين شرب كوب من الحليب أو شرب كوب من شراب عرق السوس؟ ",
"لو خيروك |  بين الشخص الذي تحبه وصديق الطفولة؟ ",
"لو خيروك |  بين أمك وأبيك؟ ",
"لو خيروك |  بين أختك وأخيك؟ ",
"لو خيروك |  بين نفسك وأمك؟ ",
"لو خيروك |  بين صديق قام بغدرك وعدوك؟ ",
"لو خيروك |  بين خسارة حبيبك/حبيبتك أو خسارة أخيك/أختك؟ ",
"لو خيروك |  بإنقاذ شخص واحد مع نفسك بين أمك أو ابنك؟ ",
"لو خيروك |  بين ابنك وابنتك؟ ",
"لو خيروك |  بين زوجتك وابنك/ابنتك؟ ",
"لو خيروك |  بين جدك أو جدتك؟ ",
"لو خيروك |  بين زميل ناجح وحده أو زميل يعمل كفريق؟ ",
"لو خيروك |  بين لاعب كرة قدم مشهور أو موسيقي مفضل بالنسبة لك؟ ",
"لو خيروك |  بين مصور فوتوغرافي جيد وبين مصور سيء ولكنه عبقري فوتوشوب؟ ",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟ ",
"لو خيروك |  بين أستاذ اللغة العربية أو أستاذ الرياضيات؟ ",
"لو خيروك |  بين أخيك البعيد أو جارك القريب؟ ",
"لو خيروك |  يبن صديقك البعيد وبين زميلك القريب؟ ",
"لو خيروك |  بين رجل أعمال أو أمير؟ ",
"لو خيروك |  بين نجار أو حداد؟ ",
"لو خيروك |  بين طباخ أو خياط؟ ",
"لو خيروك |  بين أن تكون كل ملابس بمقاس واحد كبير الحجم أو أن تكون جميعها باللون الأصفر؟ ",
"لو خيروك |  بين أن تتكلم بالهمس فقط طوال الوقت أو أن تصرخ فقط طوال الوقت؟ ",
"لو خيروك |  بين أن تمتلك زر إيقاف موقت للوقت أو أن تمتلك أزرار للعودة والذهاب عبر الوقت؟ ",
"لو خيروك |  بين أن تعيش بدون موسيقى أبدًا أو أن تعيش بدون تلفاز أبدًا؟ ",
"لو خيروك |  بين أن تعرف متى سوف تموت أو أن تعرف كيف سوف تموت؟ ",
"لو خيروك |  بين العمل الذي تحلم به أو بين إيجاد شريك حياتك وحبك الحقيقي؟ ",
"لو خيروك |  بين معاركة دب أو بين مصارعة تمساح؟ ",
"لو خيروك |  بين إما الحصول على المال أو على المزيد من الوقت؟ ",
"لو خيروك |  بين امتلاك قدرة التحدث بكل لغات العالم أو التحدث إلى الحيوانات؟ ",
"لو خيروك |  بين أن تفوز في اليانصيب وبين أن تعيش مرة ثانية؟ ",
"لو خيروك |  بأن لا يحضر أحد إما لحفل زفافك أو إلى جنازتك؟ ",
"لو خيروك |  بين البقاء بدون هاتف لمدة شهر أو بدون إنترنت لمدة أسبوع؟ ",
"لو خيروك |  بين العمل لأيام أقل في الأسبوع مع زيادة ساعات العمل أو العمل لساعات أقل في اليوم مع أيام أكثر؟ ",
"لو خيروك |  بين مشاهدة الدراما في أيام السبعينيات أو مشاهدة الأعمال الدرامية للوقت الحالي؟ ",
"لو خيروك |  بين التحدث عن كل شيء يدور في عقلك وبين عدم التحدث إطلاقًا؟ ",
"لو خيروك |  بين مشاهدة فيلم بمفردك أو الذهاب إلى مطعم وتناول العشاء بمفردك؟ ",
"لو خيروك |  بين قراءة رواية مميزة فقط أو مشاهدتها بشكل فيلم بدون القدرة على قراءتها؟ ",
"لو خيروك |  بين أن تكون الشخص الأكثر شعبية في العمل أو المدرسة وبين أن تكون الشخص الأكثر ذكاءً؟ ",
"لو خيروك |  بين إجراء المكالمات الهاتفية فقط أو إرسال الرسائل النصية فقط؟ ",
"لو خيروك |  بين إنهاء الحروب في العالم أو إنهاء الجوع في العالم؟ ",
"لو خيروك |  بين تغيير لون عينيك أو لون شعرك؟ ",
"لو خيروك |  بين امتلاك كل عين لون وبين امتلاك نمش على خديك؟ ",
"لو خيروك |  بين الخروج بالمكياج بشكل مستمر وبين الحصول على بشرة صحية ولكن لا يمكن لك تطبيق أي نوع من المكياج؟ ",
"لو خيروك |  بين أن تصبحي عارضة أزياء وبين ميك اب أرتيست؟ ",
"لو خيروك |  بين مشاهدة كرة القدم أو متابعة الأخبار؟ ",
"لو خيروك |  بين موت شخصية بطل الدراما التي تتابعينها أو أن يبقى ولكن يكون العمل الدرامي سيء جدًا؟ ",
"لو خيروك |  بين العيش في دراما قد سبق وشاهدتها ماذا تختارين بين الكوميديا والتاريخي؟ ",
"لو خيروك |  بين امتلاك القدرة على تغيير لون شعرك متى تريدين وبين الحصول على مكياج من قبل خبير تجميل وذلك بشكل يومي؟ ",
"لو خيروك |  بين نشر تفاصيل حياتك المالية وبين نشر تفاصيل حياتك العاطفية؟ ",
"لو خيروك |  بين البكاء والحزن وبين اكتساب الوزن؟ ",
"لو خيروك |  بين تنظيف الأطباق كل يوم وبين تحضير الطعام؟ ",
"لو خيروك |  بين أن تتعطل سيارتك في نصف الطريق أو ألا تتمكنين من ركنها بطريقة صحيحة؟ ",
"لو خيروك |  بين إعادة كل الحقائب التي تملكينها أو إعادة الأحذية الجميلة الخاصة بك؟ ",
"لو خيروك |  بين قتل حشرة أو متابعة فيلم رعب؟ ",
"لو خيروك |  بين امتلاك قطة أو كلب؟ ",
"لو خيروك |  بين الصداقة والحب ",
"لو خيروك |  بين تناول الشوكولا التي تحبين طوال حياتك ولكن لا يمكنك الاستماع إلى الموسيقى وبين الاستماع إلى الموسيقى ولكن لا يمكن لك تناول الشوكولا أبدًا؟ ",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟ ",
        ]

KitListbot = [
    "اسمي {bot_name} يصحبي",
    "يسطا قولتلك اسمي {bot_name} الاه",
    "نعم يحب",
    "قول يقلبو",
    "يسطا هوا عشان بحبك تصعدني؟",
    "يعم والله بحبك بس ناديلي ب {bot_name}",
    "تعرف بالله هحبك أكتر لو ناديتلي {bot_name}",
    "اي ي معلم مين مزعلك",
    "متصلي على النبي كدا",
    "مش فاضيلك نصايح وكلمني",
    "يسطا قولي مين مزعلك وعايزك تقعد وتتفرج على أخوك",
    "انجز عايزني أشقطلك مين؟",
    "شكلها منكدا عليك وجاي تطلعهم علينا",
    "ورحمة أبويا اسمي {bot_name}",
        ]